Autodesk.Revit.DB.PointLocationOnCurve.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointLocationOnCurve.MeasureFrom
The location on the curve from which the measurement is taken.
Remarks:
The measure-from is not checked until this class is assigned for a particular reference point on a particular curve.
At that time, the measure-from must be valid for the curve.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.PointLocationOnCurve.MeasurementValue
The measurement value.
Remarks:
The measurement value is not checked until this class is assigned for a particular reference point on a particular curve.
At that time, the measurement value must match the expected range for the curve for the given measurement type and measure-from.
Since:
2012

Autodesk.Revit.DB.PointLocationOnCurve.MeasurementType
The measurement type.
Remarks:
The measurement type is not checked until this class is assigned for a particular reference point on a particular curve.
At that time, the measurement type must be valid for the curve.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.PointLocationOnCurve.#ctor(Autodesk.Revit.DB.PointOnCurveMeasurementType,System.Double,Autodesk.Revit.DB.PointOnCurveMeasureFrom)
Constructs a new instance of a class, with given or default values, to place a point on a curve.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.PointLocationOnCurve
Defines the measurement parameters necessary to create a point at a specific location on a curve.
Remarks:
The class will store the following and provides functions to deal with them:
The user visible Measurement Type (driving parameter type). The corresponding measurement value (driving parameter). MeasureFrom that tells from where the (driving parameter) measurement is calculated.
Since:
2012